bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY15.xml
        <register caption="Output Compare Register" name="OCR1A" offset="0x2E" size="1" mask="0xFF"/>
        <register caption="Output Compare Register" name="OCR1B" offset="0x2D" size="1" mask="0xFF"/>
        <register caption="Timer/Counter Interrupt Mask Register" name="TIMSK" offset="0x39" size="1">
          <bitfield caption="OCIE1A: Timer/Counter1 Output Compare Interrupt Enable" mask="0x40" name="OCIE1A"/>
          <bitfield caption="Timer/Counter1 Overflow Interrupt Enable" mask="0x04" name="TOIE1"/>
        </register>
        <register caption="Timer/Counter Interrupt Flag Register" name="TIFR" offset="0x38" size="1">
          <bitfield caption="Timer/Counter1 Output Compare Flag 1A" mask="0x40" name="OCF1A"/>
          <bitfield caption="Timer/Counter1 Overflow Flag" mask="0x04" name="TOV1"/>
        </register>
        <register caption="Special Function IO Register" name="SFIOR" offset="0x2C" size="1">
          <bitfield caption="Force Output Compare 1A" mask="0x04" name="FOC1A"/>
          <bitfield caption="Prescaler Reset Timer/Counter1" mask="0x02" name="PSR1"/>
          <bitfield caption="Prescaler Reset Timer/Counter0" mask="0x01" name="PSR0"/>
        </register>
      </register-group>
      <value-group caption="" name="CLK_SEL_3BIT_EXT">
        <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
        <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
        <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
        <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
        <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
        <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
        <value caption="Running, ExtClk Tn Falling Edge" name="VAL_0x06" value="0x06"/>
        <value caption="Running, ExtClk Tn Rising Edge" name="VAL_0x07" value="0x07"/>
      </value-group>
      <value-group caption="" name="CLK_COMP_MATCH_OUT_MODE">
        <value caption="Disconnected from OCn/PWMn" name="VAL_0x00" value="0x00"/>
        <value caption="Toggle OCn/PWMn output line" name="VAL_0x01" value="0x01"/>
        <value caption="Clear OCn/PWMn output line" name="VAL_0x02" value="0x02"/>
        <value caption="set OCn/PWMn output line" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="" name="CLK_SEL_4BIT_FAST">
        <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
        <value caption="Running, CLK*16" name="VAL_0x01" value="0x01"/>
        <value caption="Running, CLK*8" name="VAL_0x02" value="0x02"/>
        <value caption="Running, CLK*4" name="VAL_0x03" value="0x03"/>
        <value caption="Running, CLK*2" name="VAL_0x04" value="0x04"/>
        <value caption="Running, No Prescaling" name="VAL_0x05" value="0x05"/>
        <value caption="Running, CLK/2" name="VAL_0x06" value="0x06"/>
        <value caption="Running, CLK/4" name="VAL_0x07" value="0x07"/>
        <value caption="Running, CLK/8" name="VAL_0x08" value="0x08"/>
        <value caption="Running, CLK/16" name="VAL_0x09" value="0x09"/>
        <value caption="Running, CLK/32" name="VAL_0x0A" value="0x0A"/>
        <value caption="Running, CLK/64" name="VAL_0x0B" value="0x0B"/>
        <value caption="Running, CLK/128" name="VAL_0x0C" value="0x0C"/>
        <value caption="Running, CLK/256" name="VAL_0x0D" value="0x0D"/>
        <value caption="Running, CLK/512" name="VAL_0x0E" value="0x0E"/>
        <value caption="Running, CLK/1024" name="VAL_0x0F" value="0x0F"/>
      </value-group>
    </module>
    <module caption="Watchdog Timer" name="WDT">
      <register-group caption="Watchdog Timer" name="WDT">
        <register caption="Watchdog Timer Control Register" name="WDTCR" offset="0x21" size="1">
          <bitfield caption="RW" mask="0x10" name="WDTOE"/>
          <bitfield caption="Watch Dog Enable" mask="0x08" name="WDE"/>
          <bitfield caption="Watch Dog Timer Prescaler bits" mask="0x07" name="WDP" values="WDOG_TIMER_PRESCALE_3BITS"/>
        </register>
      </register-group>
      <value-group caption="" name="WDOG_TIMER_PRESCALE_3BITS">
        <value caption="Oscillator Cycles 16K" name="VAL_0x00" value="0x00"/>
        <value caption="Oscillator Cycles 32K" name="VAL_0x01" value="0x01"/>
        <value caption="Oscillator Cycles 64K" name="VAL_0x02" value="0x02"/>
        <value caption="Oscillator Cycles 128K" name="VAL_0x03" value="0x03"/>
        <value caption="Oscillator Cycles 256K" name="VAL_0x04" value="0x04"/>
        <value caption="Oscillator Cycles 512K" name="VAL_0x05" value="0x05"/>
        <value caption="Oscillator Cycles 1024K" name="VAL_0x06" value="0x06"/>
        <value caption="Oscillator Cycles 2048K" name="VAL_0x07" value="0x07"/>
      </value-group>
    </module>
    <module caption="CPU Registers" name="CPU">
      <register-group caption="CPU Registers" name="CPU">
        <register caption="Status Register" name="SREG" offset="0x3F" size="1">
          <bitfield caption="Global Interrupt Enable" mask="0x80" name="I"/>
          <bitfield caption="Bit Copy Storage" mask="0x40" name="T"/>
          <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
          <bitfield caption="Sign Bit" mask="0x10" name="S"/>
          <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
          <bitfield caption="Negative Flag" mask="0x04" name="N"/>
          <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
          <bitfield caption="Carry Flag" mask="0x01" name="C"/>
        </register>
        <register caption="MCU Control Register" name="MCUCR" offset="0x35" size="1">
          <bitfield caption="Pull-up Disable" mask="0x40" name="PUD"/>
          <bitfield caption="Sleep Enable" mask="0x20" name="SE"/>
          <bitfield caption="Sleep Mode Select Bits" mask="0x18" name="SM" values="CPU_SLEEP_MODE2"/>
          <bitfield caption="Interrupt Sense Control 0 bits" mask="0x03" name="ISC0" values="INTERRUPT_SENSE_CONTROL2"/>
        </register>
